#/bin/bash

####################################
#   错误处理函数封装               #
####################################

# 展示错误
function show_error()
{
    error_message=$1
    echo "========================== [ error] ===================================="
    echo 
    echo $error_message
    echo 
    echo "========================== [ error] ===================================="
    exit 1
}

function show_title()
{
    title_message=$1
    echo "========================== [ title ] ===================================="
    echo 
    echo $title_message
    echo 
    echo "========================== [ title ] ===================================="
}
